In [1]:
from pandas import *
from numpy import *
from scipy import *
Series1  = Series([1, 2, 3, 4])
print("Series 1 is : ",Series1)

Series 1 is :  0    1
1    2
2    3
3    4
dtype: int64

In [2]:
# Extracting the Index and Values separately from a Series 
Series1_Val = Series1.values
Series1_Idx = Series1.index
print("Series values ",Series1_Val)
print("Series Indices ",Series1_Idx)

Series values  [1 2 3 4]
Series Indices  RangeIndex(start=0, stop=4, step=1)

In [3]:
# Specifying a Series with Indics pre defined
Series2 = Series([1,2,3,4], index=['a','b','c','d'])
print("Series2 = ",Series2)

Series2 =  a    1
b    2
c    3
d    4
dtype: int64

In [4]:
print("data type of Series2 is : ",Series2.dtype)

data type of Series2 is :  int64

In [5]:
# Check Data Type of Array 
array_data1 = [1,2,3,4]
Array1 = array(array_data1)
print("data type of Array1 is : ",Array1.dtype)

data type of Array1 is :  int32

In [6]:
# Dictionary and Series
# Converting Dictionary to Series 
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
Series_State = Series(sdata)
# Now Check if Indices have the Keys 
print("Indices of Series are Keys of Dict: ",Series_State.index)

Indices of Series are Keys of Dict:  Index(['Ohio', 'Texas', 'Oregon', 'Utah'], dtype='object')

In [7]:
# Now check if the key value comes in values 
print("Value of the Series is the Value of the Dict: ",Series_State.values)

Value of the Series is the Value of the Dict:  [35000 71000 16000  5000]

In [8]:
# Now consider passing Only key Values  with A Invalid Key 
States1 = ['Ohio','Texas','Oregon','California']
Series_State2 = Series(sdata,index=States1)
# Check Values now with this Key 
print("Values based on new key set ",Series_State2.values)
# Observe the NA in the position of the invalid key

Values based on new key set  [35000. 71000. 16000.    nan]

In [9]:
# Detecting missing data in series
NullCheck = isnull(Series_State2)
print("NullCheck is :  " ,NullCheck)

NullCheck is :   Ohio          False
Texas         False
Oregon        False
California     True
dtype: bool

In [10]:
# Naming the index and the Value Attributes in a Series 
Series_State.name = 'population'
Series_State.index.name = 'State'
print("State Series ", Series_State)

State Series  State
Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
Name: population, dtype: int64

In [11]:
# Data Frames
# Create a Data Frame from a Equal length list or numpy arrays 
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

# Check data type to confirm its a dictionary 
type(data)

dict

In [13]:
# Display the keys of this dictionary
print(data.keys())

dict_keys(['state', 'year', 'pop'])

In [14]:
# Convert to Dataframe 
df = DataFrame(data)

# Display the DataFrame 
print(df)
# Note column names are in alphabetical order

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [15]:
# Customize column sequence 
df_new = DataFrame(data, columns=['year', 'state', 'pop'])
print(df_new)

# Retrieving col information 
State_Data = df_new.state

# Display Retrieved Col 
print(State_Data )

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

In [21]:
# Check the indices for this dataframe
print(df_new.index)

# Print data for index position 2 
print(df_new.iloc[2])

RangeIndex(start=0, stop=5, step=1)
year     2002
state    Ohio
pop       3.6
Name: 2, dtype: object

In [22]:
# Re set data values - Year col all set to a scalar 
df_new['year'] = 2001

# re check data in this data frame : All year values changed to 2001 
print(df_new)

   year   state  pop
0  2001    Ohio  1.5
1  2001    Ohio  1.7
2  2001    Ohio  3.6
3  2001  Nevada  2.4
4  2001  Nevada  2.9

In [23]:
# Create a New column 
df_2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'])

# display new data frame 
print(df_2)

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN

In [24]:
# Fill Data in specified index positions in New Col 
val = Series([-1.2, -1.5, -1.7], index=[0, 1, 2])
df_2['debt'] = val 

# Display Dataframe again 
print(df_2 )

   year   state  pop  debt
0  2000    Ohio  1.5  -1.2
1  2001    Ohio  1.7  -1.5
2  2002    Ohio  3.6  -1.7
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN

In [25]:
# Create a Computed Column 
# Just assign a column which does not exist 
# eg create a col which is true f state is Eastern State of Ohio 
df_2["Eastern"] = df_2.state == 'Ohio'

# Display  again 
print(df_2)

   year   state  pop  debt  Eastern
0  2000    Ohio  1.5  -1.2     True
1  2001    Ohio  1.7  -1.5     True
2  2002    Ohio  3.6  -1.7     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False

In [26]:
# Delete a column 
del df_2["Eastern"]
# Display again 
print(df_2)

   year   state  pop  debt
0  2000    Ohio  1.5  -1.2
1  2001    Ohio  1.7  -1.5
2  2002    Ohio  3.6  -1.7
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN

In [27]:
# Creating a Data Frame from a nested dict of dicts 
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
df_3 = DataFrame(pop) 
# Display 
print(df_3 )

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [28]:
# Transpose
df_3_T = df_3.T 
# Display Transposed 
print(df_3.T )

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [32]:
# More on DataFrames and Indexing
# Create data Frame. Note: Matrix fills By Row as default 
DF = DataFrame(np.arange(16).reshape((4, 4)),
  index=['Ohio', 'Colorado', 'Utah', 'New York'],
  columns=['one', 'two', 'three', 'four'])
  
 # Display DF 
DF

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [33]:
# drop rows 
DF_1 = DF.drop(['Colorado', 'Ohio'])
# Display DF
DF_1

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [34]:
# Drop columns : note columns are treated as axis 1 
DF_2 = DF.drop('two',axis=1)
# Display 
DF_2

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [36]:
# Sub setting and indexing data structures: Series
# Subselect data using indexing  - 1D Array 
# Create a numeric array of size 5
Ser1 =  Series(np.arange(5),index=['a', 'b', 'c', 'd','e'])
# Display the Series 
Ser1

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [37]:
#Index by Index Name directly
Ser1_Idx_b = Ser1['b']
# Display extract
Ser1_Idx_b

1

In [38]:
# Use a Index range to Redefine Series elements 
Ser1['b':'d'] = 55
# Display after Re indexing 
Ser1

a     0
b    55
c    55
d    55
e     4
dtype: int32

In [39]:
# Sub setting and indexing data structures: DataFrames
# Create data Frame Note: Matrix fills By Row as default 
DF = DataFrame(np.arange(16).reshape((4, 4)),
  index=['Ohio', 'Colorado', 'Utah', 'New York'],
  columns=['one', 'two', 'three', 'four'])

DF

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [40]:
# Slice Two columns from DF 
# Note the Double Subscripting  to refer to columns 
DF_subset = DF[['two','three']]
# Display 
DF_subset

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [41]:
# Replace all data  values less than 5 with zeros 
DF[DF < 5] = 0
# Check replacement 
DF

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [43]:
# Use Special indexing iloc  to subselect rows then  cols 
DF_One_row_2Cols = DF.loc['Colorado', ['two', 'three']]
# Display 
DF_One_row_2Cols

two      5
three    6
Name: Colorado, dtype: int32

In [44]:
# Row pos 2 col pos 3
DF_Row2_Col3 = DF.iloc[1,2]
# Display 
DF_Row2_Col3

6

In [47]:
# Applying Functions to dataframe cols or rows
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
# Display 
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [48]:
#  default - summary applied over cols 
MaxCol = np.max(df1)
print("col Max", MaxCol)
#  summary applied over rows 
MaxRow = np.max(df1,axis=1)
print("rowmax",MaxRow)

col Max a     8.0
b     9.0
c    10.0
d    11.0
dtype: float64
rowmax 0     3.0
1     7.0
2    11.0
dtype: float64

In [49]:
# Define  inline function 
f = lambda x: x.max() - x.min()
Func_Res = df1.apply(f)
print(Func_Res)

a    8.0
b    8.0
c    8.0
d    8.0
dtype: float64

In [50]:
# Sorting for data structures
# 1)  sorting lexicographically by index 
# define series  
df1 = Series(range(4), index=['d', 'a', 'b', 'c'])
#  Display 
df1

d    0
a    1
b    2
c    3
dtype: int64

In [51]:
# Sort on index 
df1_sorted = df1.sort_index()
df1_sorted

a    1
b    2
c    3
d    0
dtype: int64

In [52]:
# Sorting for 2D  Frame 
# Create a 2D DF
DF2 = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
columns=['d', 'a', 'b', 'c'])
DF2

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [53]:
# Sort Index
DF2_Srted = DF2.sort_index()
# Display Sorted ( row index by default chosen )
DF2_Srted

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [54]:
# sort by col index 
DF2_col_srt = DF2.sort_index(axis=1)
# Display 
DF2_col_srt

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [56]:
# Quiz
import pandas as pd
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
Series_State = pd.Series(sdata)
print(Series_State.values)

[35000 71000 16000  5000]

In [57]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
print(data.keys())

dict_keys(['state', 'year', 'pop'])

In [58]:
DF = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four']) 
print(DF['one'])

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32